hboughardain/MEMO-H504/PIC32CM5164LS00/NonSecure/firmware/src/packs/PIC32CM5164LS00064_DFP/component/pac.h
/* -------- PAC_SECLOCKA : (PAC Offset: 0x74) ( R/ 32) Peripheral secure status locked - Bridge A -------- */
#define PAC_SECLOCKA_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_SECLOCKA) Peripheral secure status locked - Bridge A  Reset Value */

#define PAC_SECLOCKA_PAC_Pos                  _UINT32_(0)                                          /* (PAC_SECLOCKA) PAC Secure Status Locked Position */
#define PAC_SECLOCKA_PAC_Msk                  (_UINT32_(0x1) << PAC_SECLOCKA_PAC_Pos)              /* (PAC_SECLOCKA) PAC Secure Status Locked Mask */
#define PAC_SECLOCKA_PAC(value)               (PAC_SECLOCKA_PAC_Msk & (_UINT32_(value) << PAC_SECLOCKA_PAC_Pos)) /* Assigment of value for PAC in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_PM_Pos                   _UINT32_(1)                                          /* (PAC_SECLOCKA) PM Secure Status Locked Position */
#define PAC_SECLOCKA_PM_Msk                   (_UINT32_(0x1) << PAC_SECLOCKA_PM_Pos)               /* (PAC_SECLOCKA) PM Secure Status Locked Mask */
#define PAC_SECLOCKA_PM(value)                (PAC_SECLOCKA_PM_Msk & (_UINT32_(value) << PAC_SECLOCKA_PM_Pos)) /* Assigment of value for PM in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_MCLK_Pos                 _UINT32_(2)                                          /* (PAC_SECLOCKA) MCLK Secure Status Locked Position */
#define PAC_SECLOCKA_MCLK_Msk                 (_UINT32_(0x1) << PAC_SECLOCKA_MCLK_Pos)             /* (PAC_SECLOCKA) MCLK Secure Status Locked Mask */
#define PAC_SECLOCKA_MCLK(value)              (PAC_SECLOCKA_MCLK_Msk & (_UINT32_(value) << PAC_SECLOCKA_MCLK_Pos)) /* Assigment of value for MCLK in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_RSTC_Pos                 _UINT32_(3)                                          /* (PAC_SECLOCKA) RSTC Secure Status Locked Position */
#define PAC_SECLOCKA_RSTC_Msk                 (_UINT32_(0x1) << PAC_SECLOCKA_RSTC_Pos)             /* (PAC_SECLOCKA) RSTC Secure Status Locked Mask */
#define PAC_SECLOCKA_RSTC(value)              (PAC_SECLOCKA_RSTC_Msk & (_UINT32_(value) << PAC_SECLOCKA_RSTC_Pos)) /* Assigment of value for RSTC in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_OSCCTRL_Pos              _UINT32_(4)                                          /* (PAC_SECLOCKA) OSCCTRL Secure Status Locked Position */
#define PAC_SECLOCKA_OSCCTRL_Msk              (_UINT32_(0x1) << PAC_SECLOCKA_OSCCTRL_Pos)          /* (PAC_SECLOCKA) OSCCTRL Secure Status Locked Mask */
#define PAC_SECLOCKA_OSCCTRL(value)           (PAC_SECLOCKA_OSCCTRL_Msk & (_UINT32_(value) << PAC_SECLOCKA_OSCCTRL_Pos)) /* Assigment of value for OSCCTRL in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_OSC32KCTRL_Pos           _UINT32_(5)                                          /* (PAC_SECLOCKA) OSC32KCTRL Secure Status Locked Position */
#define PAC_SECLOCKA_OSC32KCTRL_Msk           (_UINT32_(0x1) << PAC_SECLOCKA_OSC32KCTRL_Pos)       /* (PAC_SECLOCKA) OSC32KCTRL Secure Status Locked Mask */
#define PAC_SECLOCKA_OSC32KCTRL(value)        (PAC_SECLOCKA_OSC32KCTRL_Msk & (_UINT32_(value) << PAC_SECLOCKA_OSC32KCTRL_Pos)) /* Assigment of value for OSC32KCTRL in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_SUPC_Pos                 _UINT32_(6)                                          /* (PAC_SECLOCKA) SUPC Secure Status Locked Position */
#define PAC_SECLOCKA_SUPC_Msk                 (_UINT32_(0x1) << PAC_SECLOCKA_SUPC_Pos)             /* (PAC_SECLOCKA) SUPC Secure Status Locked Mask */
#define PAC_SECLOCKA_SUPC(value)              (PAC_SECLOCKA_SUPC_Msk & (_UINT32_(value) << PAC_SECLOCKA_SUPC_Pos)) /* Assigment of value for SUPC in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_GCLK_Pos                 _UINT32_(7)                                          /* (PAC_SECLOCKA) GCLK Secure Status Locked Position */
#define PAC_SECLOCKA_GCLK_Msk                 (_UINT32_(0x1) << PAC_SECLOCKA_GCLK_Pos)             /* (PAC_SECLOCKA) GCLK Secure Status Locked Mask */
#define PAC_SECLOCKA_GCLK(value)              (PAC_SECLOCKA_GCLK_Msk & (_UINT32_(value) << PAC_SECLOCKA_GCLK_Pos)) /* Assigment of value for GCLK in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_WDT_Pos                  _UINT32_(8)                                          /* (PAC_SECLOCKA) WDT Secure Status Locked Position */
#define PAC_SECLOCKA_WDT_Msk                  (_UINT32_(0x1) << PAC_SECLOCKA_WDT_Pos)              /* (PAC_SECLOCKA) WDT Secure Status Locked Mask */
#define PAC_SECLOCKA_WDT(value)               (PAC_SECLOCKA_WDT_Msk & (_UINT32_(value) << PAC_SECLOCKA_WDT_Pos)) /* Assigment of value for WDT in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_RTC_Pos                  _UINT32_(9)                                          /* (PAC_SECLOCKA) RTC Secure Status Locked Position */
#define PAC_SECLOCKA_RTC_Msk                  (_UINT32_(0x1) << PAC_SECLOCKA_RTC_Pos)              /* (PAC_SECLOCKA) RTC Secure Status Locked Mask */
#define PAC_SECLOCKA_RTC(value)               (PAC_SECLOCKA_RTC_Msk & (_UINT32_(value) << PAC_SECLOCKA_RTC_Pos)) /* Assigment of value for RTC in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_EIC_Pos                  _UINT32_(10)                                         /* (PAC_SECLOCKA) EIC Secure Status Locked Position */
#define PAC_SECLOCKA_EIC_Msk                  (_UINT32_(0x1) << PAC_SECLOCKA_EIC_Pos)              /* (PAC_SECLOCKA) EIC Secure Status Locked Mask */
#define PAC_SECLOCKA_EIC(value)               (PAC_SECLOCKA_EIC_Msk & (_UINT32_(value) << PAC_SECLOCKA_EIC_Pos)) /* Assigment of value for EIC in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_FREQM_Pos                _UINT32_(11)                                         /* (PAC_SECLOCKA) FREQM Secure Status Locked Position */
#define PAC_SECLOCKA_FREQM_Msk                (_UINT32_(0x1) << PAC_SECLOCKA_FREQM_Pos)            /* (PAC_SECLOCKA) FREQM Secure Status Locked Mask */
#define PAC_SECLOCKA_FREQM(value)             (PAC_SECLOCKA_FREQM_Msk & (_UINT32_(value) << PAC_SECLOCKA_FREQM_Pos)) /* Assigment of value for FREQM in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_PORT_Pos                 _UINT32_(12)                                         /* (PAC_SECLOCKA) PORT Secure Status Locked Position */
#define PAC_SECLOCKA_PORT_Msk                 (_UINT32_(0x1) << PAC_SECLOCKA_PORT_Pos)             /* (PAC_SECLOCKA) PORT Secure Status Locked Mask */
#define PAC_SECLOCKA_PORT(value)              (PAC_SECLOCKA_PORT_Msk & (_UINT32_(value) << PAC_SECLOCKA_PORT_Pos)) /* Assigment of value for PORT in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_AC_Pos                   _UINT32_(13)                                         /* (PAC_SECLOCKA) AC Secure Status Locked Position */
#define PAC_SECLOCKA_AC_Msk                   (_UINT32_(0x1) << PAC_SECLOCKA_AC_Pos)               /* (PAC_SECLOCKA) AC Secure Status Locked Mask */
#define PAC_SECLOCKA_AC(value)                (PAC_SECLOCKA_AC_Msk & (_UINT32_(value) << PAC_SECLOCKA_AC_Pos)) /* Assigment of value for AC in the PAC_SECLOCKA register */
#define PAC_SECLOCKA_Msk                      _UINT32_(0x00003FFF)                                 /* (PAC_SECLOCKA) Register Mask  */


/* -------- PAC_SECLOCKB : (PAC Offset: 0x78) ( R/ 32) Peripheral secure status locked - Bridge B -------- */
#define PAC_SECLOCKB_RESETVALUE               _UINT32_(0x03)                                       /*  (PAC_SECLOCKB) Peripheral secure status locked - Bridge B  Reset Value */

